<?php
/*
+---------------------------------------------------------+
| 项目: FCS -- Fast,Compatible & Simple OOP PHP Framework |
| 文件: fcsAction.class.php								  |
| 功能: Action控制器类									  |
+---------------------------------------------------------+
| 本框架代码基于GPL协议，可免费使用，但必须保留版权信息	  |
| 版权声明: Copyright◎ 2005-2006 世纪流年 版权所有		  |
| 主 页:	http://www.liu21st.com						  |
| 作 者:	Liu21st <流年> liu21st@gmail.com			  |
+---------------------------------------------------------+
*/

class fcsAction extends Action 
{


	//+----------------------------------------
	//|	架构函数
	//| 如果没有应用模块公共类定义的话
	//| 需要定义架构函数来执行公共操作
	//| 和执行应用程序类的Exec方法
	//+----------------------------------------


	//+----------------------------------------
	//|	可以在这里添加任何需要的公共方法
	//+----------------------------------------
	function Init(){
		//公用方法

		return ;
	}

	//+----------------------------------------
	//|	操作方法
	//+----------------------------------------
	function Index()
	{

		//定义默认的操作方法 注意：默认的操作方法在配置文件中定义
		//这里使用最简单的页面显示
		$this->Display();
		return;
	}

	//+----------------------------------------
	//|	news操作方法
	//+----------------------------------------
	function news()
	{
		//定义Add操作方法
		//程序代码
		//……
		$this->Display();
		return;
	}

	//+----------------------------------------
	//|	docs操作方法
	//+----------------------------------------
	function docs()
	{
		//定义Add操作方法
		//程序代码
		//……
		$this->Display();
		return;
	}
	//+----------------------------------------
	//|	update操作方法
	//+----------------------------------------
	function update()
	{
		//定义Add操作方法
		//程序代码
		//……
		$this->Display();
		return;
	}
	//+----------------------------------------
	//|	sites操作方法
	//+----------------------------------------
	function sites()
	{
		//定义Add操作方法
		//程序代码
		//……
		$this->Display();
		return;
	}

	//+----------------------------------------
	//|	析构函数
	//+----------------------------------------
	function __destruct(){

	}
}
?>