<?php
/*
+--------------------------------------------------------
| 项目: FCS -- Fast,Compatible & Simple OOP PHP Framework
| 版本: 0.6.0
| PHP:	4.3.0 以上
| 文件: index.class.php
| 功能:  直接继承应用程序类的index应用模块类
| 最后修改：2006-1-19
+--------------------------------------------------------
| 版权声明: Copyright◎ 2005-2006 世纪流年 版权所有
| 主 页:	http://www.liu21st.com
| 作 者:	Liu21st <流年> liu21st@gmail.com 
+--------------------------------------------------------
*/

class mod_index extends App //该模块直接继承应用程序类
{

	//+----------------------------------------
	//|	公共变量 可供应用类调用，但不输出
	//+----------------------------------------
	var $Public = Array();

	//+----------------------------------------
	//|	架构函数
	//| 如果没有应用模块公共类定义的话
	//| 需要定义架构函数来执行公共操作
	//| 和执行应用程序类的Exec方法
	//+----------------------------------------
	function __construct()
	{
		//定义每次应用程序都要进行的操作
		//比如 登录检查 公共变量定义
		$this->__Init();

		
		// 执行应用程序
		// 该方法在定义模块类的时候必须执行

		parent::Exec();		

		return;
	}

	//+----------------------------------------
	//|	可以在这里添加任何需要的公共方法
	//+----------------------------------------
	function __Init(){
		//公用方法
		$this->Tpl['webTitle'] = WEB_TITLE;
		$this->Tpl['viaTitle'] = MODULE_NAME;
		return ;
	}

	//+----------------------------------------
	//|	操作方法
	//+----------------------------------------
	function Index()
	{

		//定义默认的操作方法 注意：默认的操作方法在配置文件中定义
		//这里使用最简单的页面显示
		$this->Display();
		
		return;
	}


	//+----------------------------------------
	//|	析构函数
	//+----------------------------------------
	function __destruct(){

	}
}
?>