<?php 
/*
+---------------------------------------------------------+
| 项目: FCS -- Fast,Compatible & Simple OOP PHP Framework |
| 文件: zh-cn.php										  |
| 功能: 简体中文语言包									  |
+---------------------------------------------------------+
| 本框架代码基于GPL协议，可免费使用，但必须保留版权信息	  |
| 版权声明: Copyright◎ 2005-2006 世纪流年 版权所有		  |
| 主 页:	http://www.liu21st.com						  |
| 作 者:	Liu21st <流年> liu21st@gmail.com			  |
+---------------------------------------------------------+
*/

	//+----------------------------------------
	//|	核心
	//+----------------------------------------
	define('_PAGE_ERROR',			'页面出错');
	define('_MODULE_NOT_EXIST_',	'无法加载模块');
	define('_ERROR_ACTION_',		'非法操作');
	define('_LANGUAGE_NOT_LOAD_',	'无法加载语言包');
	define('_TEMPLATE_NOT_EXIST_',	'模板不存在');


	//+----------------------------------------
	//|	错误提示
	//+----------------------------------------
	define('_WAITING_GOTO_EXIST_',	'请等待系统转向...');

	//+----------------------------------------
	//|	数据库
	//+----------------------------------------	
	define('_DB_TYPE_NOT_EXIST_',	'没有指定数据库类型或该类库不存在！');
	define('_DB_CONNECT_ERROR_',	'数据库连接失败！');
?>