<?php 
/*
+--------------------------------------------------------
| 项目: FCS -- Fast,Compatible & Simple OOP PHP Framework
| 版本: 0.6.0
| PHP:	4.3.0 以上
| 文件: zh-cn.php
| 功能:  简体中文语言包
| 最后修改：2006-1-19
+--------------------------------------------------------
| 版权声明: Copyright◎ 2005-2006 世纪流年 版权所有
| 主 页:	http://www.liu21st.com
| 作 者:	Liu21st <流年> liu21st@gmail.com 
+--------------------------------------------------------
*/

	//+----------------------------------------
	//|	通用设置
	//+----------------------------------------
	define('_PAGE_ERROR',			'页面出错');
	define('_MODULE_NOT_EXIST_',			'无法加载模块');
	define('_ERROR_ACTION_',			'非法操作');
	define('_LANGUAGE_NOT_LOAD_',			'无法加载语言包');
	define('_TEMPLATE_NOT_EXIST_',			'模板不存在');


	//+----------------------------------------
	//|	错误提示
	//+----------------------------------------


?>