<?php 
// +---------------------------------------------------------------------------+
// | FCS -- Fast,Compatible & Simple OOP PHP Framework                         |
// +---------------------------------------------------------------------------+
// | Copyright (c) 2005-2006 liu21st.com.  All rights reserved.                |
// | Website: http://www.fcs.org.cn/                                           |
// | Author : Liu21st 流年 <liu21st@gmail.com>                                 |
// +---------------------------------------------------------------------------+
// | This program is free software; you can redistribute it and/or modify it   |
// | under the terms of the GNU General Public License as published by the     |
// | Free Software Foundation; either version 2 of the License,  or (at your   |
// | option) any later version.                                                |
// |                                                                           |
// | This program is distributed in the hope that it will be useful,  but      |
// | WITHOUT ANY WARRANTY; without even the implied warranty of                |
// | MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General |
// | Public License for more details.                                          |
// +---------------------------------------------------------------------------+

/**
 +------------------------------------------------------------------------------
 * FCS
 +------------------------------------------------------------------------------
 * @package    Core
 * @link       http://www.fcs.org.cn
 * @copyright  Copyright (c) 2005-2006 liu21st.com.  All rights reserved. 
 * @author     liu21st <liu21st@gmail.com>
 * @version    $Id$
 +------------------------------------------------------------------------------
 */

/**
 +------------------------------------------------------------------------------
 * 权限认证类
 *	包含:(按顺序检查)
 *	1.检查用户状态
 *	2.检查用户所在的组的状态
 *	3.检查组的模块权限
 *	4.检查组的操作权限
 *
 +------------------------------------------------------------------------------
 * @package   core
 * @author    liu21st <liu21st@gmail.com>
 * @version   $Ver$
 +------------------------------------------------------------------------------
 */
class auth extends Base
{//类定义开始

    /**
     +----------------------------------------------------------
     * 架构函数
     * 
     +----------------------------------------------------------
     * @static
     * @access public 
     +----------------------------------------------------------
     */
    function __construct($user)
    {

    }

    /**
     +----------------------------------------------------------
     * 检查用户状态
     * 
     +----------------------------------------------------------
     * @static
     * @access public 
     +----------------------------------------------------------
     * @param mixed $user 用户对象
     +----------------------------------------------------------
     * @return boolean
     +----------------------------------------------------------
     * @throws FcsException
     +----------------------------------------------------------
     */
    function checkUser($user) 
    {
    	
    }

    /**
     +----------------------------------------------------------
     * 检查用户组状态
     * 
     +----------------------------------------------------------
     * @static
     * @access public 
     +----------------------------------------------------------
     * @param mixed $group 用户组对象
     +----------------------------------------------------------
     * @return boolean
     +----------------------------------------------------------
     * @throws FcsException
     +----------------------------------------------------------
     */
	function checkGroup($group) 
	{
		
	}

    /**
     +----------------------------------------------------------
     * 检查模块权限
     * 
     +----------------------------------------------------------
     * @static
     * @access public 
     +----------------------------------------------------------
     * @param mixed $module 模块对象
     +----------------------------------------------------------
     * @return boolean
     +----------------------------------------------------------
     * @throws FcsException
     +----------------------------------------------------------
     */
    function checkModule($module) 
    {
    	
    }

    /**
     +----------------------------------------------------------
     * 检查操作权限
     * 
     +----------------------------------------------------------
     * @static
     * @access public 
     +----------------------------------------------------------
     * @param mixed $action 操作
     +----------------------------------------------------------
     * @return boolean
     +----------------------------------------------------------
     * @throws FcsException
     +----------------------------------------------------------
     */
    function checkAction($action) 
    {
    	
    }
}//类定义结束
?>