<?php
/*
+---------------------------------------------------------+
| 项目: FCS -- Fast,Compatible & Simple OOP PHP Framework |
| 文件: indexAction.class.php							  |
| 功能: Action控制器类									  |
+---------------------------------------------------------+
| 本框架代码基于GPL协议，可免费使用，但必须保留版权信息	  |
| 版权声明: Copyright◎ 2005-2006 世纪流年 版权所有		  |
| 主 页:	http://www.liu21st.com						  |
| 作 者:	Liu21st <流年> liu21st@gmail.com			  |
+---------------------------------------------------------+
*/

class indexAction extends Action //该模块直接继承应用程序类
{

	//+----------------------------------------
	//|	架构函数
	//| 如果没有应用模块公共类定义的话
	//| 需要定义架构函数来执行公共操作
	//| 和执行应用程序类的Exec方法
	//+----------------------------------------
	function __construct()
	{
		parent::__construct();
		$this->Init();

	}

	//+----------------------------------------
	//|	可以在这里添加任何需要的公共方法
	//+----------------------------------------
	function Init(){
		//模块初始化

		//公用方法
		$this->assign('webTitle',WEB_TITLE);
		$this->assign('viaTitle',MODULE_NAME);

		return ;
	}


	//+----------------------------------------
	//|	操作方法
	//+----------------------------------------
	function Index()
	{

		$this->Display();
		return;
	}

	//+----------------------------------------
	//|	析构函数
	//+----------------------------------------
	function __destruct(){

	}
}
?>