<?php
/*
+--------------------------------------------------------
| 项目: FCS -- Fast,Compatible & Simple OOP PHP Framework
| 版本: 0.6.1
| PHP:	4.3.0 以上
| 文件: blog.class.php
| 功能:  
| 最后修改：2006-1-19
+--------------------------------------------------------
| 版权声明: Copyright◎ 2005-2006 世纪流年 版权所有
| 主 页:	http://www.liu21st.com
| 作 者:	Liu21st <流年> liu21st@gmail.com 
+--------------------------------------------------------
*/

class mod_blog extends App //该模块直接继承应用程序类
{

	//+----------------------------------------
	//|	公共变量 可供应用类调用，但不输出
	//+----------------------------------------
	var $Public = Array();

	//+----------------------------------------
	//|	架构函数
	//| 如果没有应用模块公共类定义的话
	//| 需要定义架构函数来执行公共操作
	//| 和执行应用程序类的Exec方法
	//+----------------------------------------
	function __construct()
	{
		header("Location:http://blog.liu21st.com"); 
		return;
	}

	
	//+----------------------------------------
	//|	析构函数
	//+----------------------------------------
	function __destruct(){

	}
}
?>